{
  "encounters": {
    "adventure_guild": {
      "description": "\n\nThe guild hall hums with the quiet buzz of purpose, a crossroads for adventurers seeking refuge, work, or the thrill of discovery. The air is rich with the mingling scents of firewood, leather, and faint traces of spices from distant lands. A large stone hearth dominates one side of the room, its crackling fire casting flickering shadows that dance along the wooden beams.\nBehind the counter stands Elara, the guild's innkeeper and owner, her silver hair catching the firelight like threads of moonlight. Her sharp green eyes seem to miss nothing, her presence calm yet commanding, as though the hall itself bends to her quiet authority.\nOpposite the fire, a job board leans slightly under the weight of countless pinned notices, their edges curled and inked words hinting at danger, rewards, or mystery. Nearby, the shopkeeper's stall is a burst of controlled chaos—shelves crowded with glimmering potions, polished weapons, and peculiar trinkets that beg for closer inspection.\nPerched on a counter, a sleek gray tabby cat surveys the scene through half-closed eyes, its contented purr blending seamlessly into the warmth of the hall. Here, decisions linger in every glance—whether to browse, rest, or step boldly into the unknown.\n\n",
      "choices": {
        "1": {
          "text": "Approach the Job Board.",
          "response": "You step forward, looking over the board's offerings once more. There are quests of all kinds, from delivering a package to uncovering hidden treasures.\n",
          "next": "guild_job_board"
        },
        "2": {
          "text": "Visit the Shop.",
          "response": "You glance over at the shopkeeper's stall near the hearth, where an array of weapons, potions, and odd trinkets are displayed. The shopkeeper, a burly man with a gruff voice, notices you approaching.\n",
          "next": "guild_shop"
        },
        "3": {
          "text": "Rest by the Fireplace.",
          "response": "The hearth crackles invitingly, and the warm glow beckons you closer. You feel the weight of the road behind you and a moment of rest seems like the perfect idea.\n",
          "next": "guild_fireplace"
        },
        "4": {
          "text": "Approach the cat.",
          "response": "The cat stretches lazily and eyes you with interest. Its soft purr fills the air as it flicks its tail toward you, clearly inviting attention\n",
          "next": "guild_cat"
        },
        "5": {
          "text": "Leave the Inn.",
          "response": "You take a final glance at the inn's warm atmosphere before turning to leave. The open doors beckon once more.\n",
          "next": "random_encounter"
        }
      }
    },
    "guild_job_board": {
      "description": "The job board is a haphazard collection of parchment, some neatly pinned while others flutter in the breeze. It's a mix of quests, from high-paying noble tasks to more desperate notices. A few letters are crisp and formal, offering riches for dangerous errands, while others are scrawled in haste, detailing missing persons or local beasts that need slaying. Some requests are modest, like helping with harvests or fixing a fence, while others hint at far more dangerous or mysterious work. Each paper offers a new potential adventure, waiting to be claimed by whoever dares to answer.\nWarning this will lead to a new event. If you still have unfinished business at the guild turn back.\n",
      "choices": {
        "1": {
          "text": "\"I'll take a closer look at the new quests posted.\"\n",
          "response": "You approach the board and as you scan all the papers littered you notice one you like the sound of and pick it up.\n",
          "job": "job_board",
          "next": "adventure_guild"
        },
        "2": {
          "text": "\"Nothing suits me here today\"\n",
          "response": "You return to the entrance hall of the guild.",
          "next": "adventure_guild"
        }
      }
    },
    "guild_shop": {
      "description": "The shop is a cozy nook, its shelves lined with an eclectic mix of items: glimmering potions, rusty weapons, and strange trinkets from distant lands. The air is thick with the scent of herbs and leather, and the flickering light from the nearby hearth casts a warm glow on the polished counters. The shopkeeper, a burly man with a sharp eye for detail, watches you closely as you browse. Each item seems to tell a story, whether it's a finely crafted sword or an old map that's seen better days. There's something here for every traveler, from the most humble to the most daring.",
      "choices": {
        "1": {
          "text": "\"What do you have for sale today?\"\n",
          "response": "Shopkeeper: Blades, potions, maps, and a few trinkets. If you don't see what you need, just ask, I might have something in the back.\n",
          "shop": "shop",
          "next": "guild_shop"
        },
        "2": {
          "text": "\"I'm not looking for anything right now. Just browsing.\"\n",
          "response": "Shopkeeper: Aye, most come in just for a look. But when you need something, you'll remember where to find me",
          "next": "adventure_guild"
        },
        "3": {
          "text": "\"I have this item I wonder if you could take a look at it?\"\n",
          "response": "Shopkeeper: Let me see what you have there lad.",
          "next": "adventure_guild"
        }
      }
    },
    "guild_fireplace": {
      "description": "The fireplace crackles with warmth, its flames dancing in shades of orange and gold. The hearth is large, made of rough stone, and the fire casts flickering shadows across the room. The scent of burning wood fills the air, blending with the rich, earthy smell of the room. A young woman in a simple white sundress stands near the fire, her movements graceful as she tends to the flames. She adjusts a log with a metal poker, the light catching her hair, which falls in soft waves around her shoulders. Her presence adds a calm serenity to the scene, as if the fire is her domain, and the room seems warmer for it.",
      "choices": {
        "1": {
          "text": "\"I'll take a seat here, warm my bones. It's been a long journey.\"\n",
          "response": "You settle into one of the worn but comfortable chairs near the fireplace, letting the warmth of the flames wash over you. The fire crackles, its heat soothing your tired muscles. The soft murmur of the inn's quiet atmosphere surrounds you, the peacefulness of the moment almost tempting you to drift off. After a while, you rise, refreshed and ready, and step towards the entrance hall.\n",
          "health": 10,
          "next": "adventure_guild"
        },
        "2": {
          "text": "\"I'd prefer a bed upstairs. Time to call it a night.\"\n",
          "response": "With a final glance at the flickering fire, you rise and make your way toward the staircase. Elara nods as you pass, pointing to a door near the top of the stairs.\nElara: \"Rest well!\"\n You climb the creaky steps, the warmth of the hearth fading as you reach the quiet solitude of your room. After a restful night, you wake refreshed and descend back into the entrance hall, where new opportunities await.\n",
          "health": 20,
          "next": "adventure_guild"
        }
      }
    },
    "guild_cat": {
      "description": "The sleek grey cat lies peacefully on a decorative cushion atop the counter, its soft fur glistening in the warm glow of the fireplace. Light gray stripes run down its back, while its white paws and belly rise and fall with each slow, contented breath. Its ears are perked slightly, attuned to the subtle sounds of the room, yet its relaxed posture exudes pure comfort and trust. The ornate cushion beneath it, adorned with intricate patterns, gives the scene an air of quiet elegance. As you approach, the cat opens one golden eye, watching you with mild curiosity before curling back into its tranquil slumber.",
      "choices": {
        "1": {
          "text": "Pet the cat.",
          "response": "You reach out gently, and the tabby cat perks up, its golden eyes locking onto yours for a moment. As your fingers scratch behind its ears, it lets out a soft purr, leaning into your touch. The warmth of its fur and the steady vibration of its purring are oddly comforting, a small but welcome reprieve from the day's burdens. After a moment, the cat stretches lazily, then settles back onto its cushion, seemingly pleased with the attention. With a faint smile, you turn back to the entrance hall.",
          "next": "adventure_guild"
        },
        "2": {
          "text": "No time for pets today.",
          "response": "The cat's golden eyes flick up at you as you pass, but it seems content to remain lounging on its ornate cushion. ",
          "next": "adventure_guild"
        }
      }
    },
    "farmer_help": {
      "description": "You walk down the road, the sun beating down on your shoulders. The quiet of the countryside is almost unnerving after the bustle of the last town. A few minutes pass, and soon you notice a figure ahead—an older man, dressed in a faded shirt and worn trousers, his face weathered by years of outdoor labor. He is hunched over in a small garden, carefully planting something in the rich, dark earth. The sound of birds chirping and insects buzzing fills the air.\n\nAs you approach, the man looks up, his expression unreadable. He wipes his brow with the back of his hand, and gives you a slow, deliberate nod.\n\nFarmer: \"Not many folks pass by these parts. What brings you here, traveler?\" ",
      "choices": {
        "1": {
          "text": "Ask about the farm.",
          "response": "This farm looks small but well-kept. How long have you been working here?\n\n\"All my life,\" the farmer replies humbly. \"Raised on this very land, and I'll likely die here too. It's a good life, if you don't mind the solitude.\"",
          "next": "adventure_guild"
        },
        "2": {
          "text": "Offer to help.",
          "response": "Well now, that's a rare offer. A good many folks wouldn't think to help an old man like me. I could use a bit of it, though.\n\nThese old bones aren't as fast as they used to be, and this farm's more work than it seems.\n\nIf you're up for it, there's a well not far from here. You could fetch a couple of buckets of water for me, and I'll put you up for the night in exchange.\n\nNo need to keep traveling after sundown, eh? You can rest easy here.\n\n\"Sounds good. I'll go fetch the water.\"\n\n\"That's the spirit! Follow the path there, just past the barn.\n\nIt's a bit of a trek, but the well's deep and clear. Bring back a couple of buckets, and I'll have dinner ready by the time you get back.\n\nYou make your way to the well, the air growing quieter as you walk. After drawing two buckets of cool, clear water, you notice something half-buried in the underbrush. You kneel down and uncover an old, faded cloth pouch. Inside, you find a few small, smooth pebbles and a bit of worn string—nothing of real value, just odds and ends, as if someone had forgotten or discarded them.\n\nA sudden rustle from the trees catches your attention, and you quickly tuck the pouch into your bag, feeling an odd unease. You gather the buckets and head back toward the farmstead.\n\nYou return to the barn, water in hand, and the smell of stew wafts through the air. The farmer greets you with a nod, taking the buckets from you and leading you to the table.\n\n\"Right on time. Dinner's about ready, and you're welcome to stay the night. No need to keep traveling after dark.\"\n\nYou sit down to a simple meal of stew and bread, the warmth of the fire and the hearty food filling you with a sense of comfort.\n\n\"Not many folks come this way. It's quiet out here. Sometimes too quiet. But no need to worry about that. You've done me a good turn today, and I'm glad for the company.\"\n\nAfter the meal, the farmer leads you to a bedroll by the hearth. The fire crackles softly, and you feel the weight of the journey fall away as you settle in for the night. The pouch in your bag is still there, but its meaning remains unclear, leaving a small flicker of curiosity before sleep takes over.",
          "inventory_add": [
            "smooth_pebbles",
            "string"
          ],
          "next": "adventure_guild"
        },
        "3": {
          "text": "Ask about the road ahead.",
          "response": "The farmer looks up thoughtfully. \"Well, if you keep heading that way, you'll come across an old mill. Folks say it's haunted. I'd steer clear of it if I were you, but if you are set on going, watch your back.\"",
          "next": "haunted_mill"
        }
      }
    },
    "haunted_mill": {
      "description": "As you continue on with your journey, you find yourself standing before an old, decrepit mill. The wood is rotting, and the air is thick with an eerie silence. Something about it feels... off. There's a locked door on the front, and the windows are boarded up.",
      "choices": {
        "1": {
          "text": "Explore the mill",
          "response": "You decide to approach the mill. The door is locked, but you can hear faint noises coming from inside.",
          "next": "locked_door"
        },
        "2": {
          "text": "Leave the mill",
          "response": "You decide that the mill is best left unexplored and continue down the road.",
          "next": "adventure_guild"
        }
      }
    },
    "locked_door": {
      "description": "The door is old, its wood rotting with age. It creaks as you push on it, but it doesn't budge. You could try breaking it down, give up, or look for another way in.",
      "choices": {
        "1": {
          "text": "Break the door down",
          "response": "You muster all your strength and break the door down. The air inside is heavy with dust and the smell of decay. As you step inside, an ominous presence fills the room.",
          "next": "skeleton_room"
        },
        "2": {
          "text": "Give up",
          "response": "You walk away from the mill, feeling a sense of unease. Maybe it's best not to push your luck.",
          "next": "adventure_guild"
        },
        "3": {
          "text": "Look for another way in",
          "response": "You walk around the mill trying to locate a different way in, somewhere close by in the grass you see a small copper ring. As you keep exploring around the mill, you find a small, broken window and crawl inside, carefully avoiding the sharp glass.",
          "inventory_add": [
            "copper_ring"
          ],
          "next": "skeleton_room"
        }
      }
    },
    "skeleton_room": {
      "description": "Inside the mill, you find a small room. A skeleton lies on the floor, its only piece of clothing being a pair of black leather boots. The room is cold and damp, and you can feel the presence of something watching you.",
      "choices": {
        "1": {
          "text": "Take the boots",
          "response": "As soon as you grab the boots, the skeleton's eyes glow! The room grows colder, and a ghostly entity rises from the shadows!",
          "inventory_add": [
            "black_leather_boots"
          ],
          "combat": "skeleton",
          "next": "adventure_guild"
        },
        "2": {
          "text": "Leave the item and go back",
          "response": "You leave the item alone and quickly exit the mill. The unease lingers, but you're glad to be out.",
          "next": "adventure_guild"
        }
      }
    },
    "silver_stag_tale": {
      "description": "The sun is setting as you step into The White Horse, a cozy tavern in Stonehaven. The warmth of the fire welcomes you inside, and the smell of hearty food and spiced wine fills the air. At the bar, a friendly barmaid named Mira greets you. She offers you a drink but, after a few moments, her tone becomes serious.\n\nMira: \"Something strange is happening around here lately... It's a tale that's been passed down for generations, and you might think it's all just superstition, but I swear there's truth to it. They say that on certain nights, a silver stag appears in the forest. A beautiful creature, with fur like shimmering moonlight, and eyes that hold secrets of the world. But be warned, those who have gone looking for it... they never return quite the same. Some even say the stag holds power—grants wishes or curses those who seek it.\"",
      "choices": {
        "1": {
          "text": "Search for the Silver Stag",
          "response": "A silver stag, you say? Sounds like an interesting challenge.",
          "next": "search_for_stag"
        },
        "2": {
          "text": "Dismiss the Tale",
          "response": "I think I'll stick to something a little less... supernatural.",
          "next": "adventure_guild"
        },
        "3": {
          "text": "Ask for More Details",
          "response": "Tell me more about the silver stag. Has anyone else seen it?",
          "next": "ask_for_more_details"
        }
      }
    },
    "search_for_stag": {
      "description": "You decide to head into the forest, hoping to find the elusive stag. The whispers of the tavern still linger in your mind as you venture down the trail, the shadows of the trees growing deeper with each step.",
      "choices": {
        "1": {
          "text": "Meet the Stag and Perform the Trial",
          "response": "The stag appears, waiting for you. It looks at you with ancient eyes, its gaze piercing your very soul. You must prove your worth.",
          "next": "trial_encounter"
        },
        "2": {
          "text": "Attempt to Kill the Stag",
          "response": "You decide to try and kill the stag, seeing it as a challenge.",
          "next": "kill_stag_encounter"
        }
      }
    },
    "ask_for_more_details": {
      "description": "Mira looks around cautiously, her voice dropping to a whisper.\n\nMira: \n\"Well, I'll tell you what I know, but you've got to promise to be careful. It's not just the stag... there's more to this forest. A long time ago, there was an ancient ritual, a kind of communion with the forest's spirit, to keep the balance. But the ritual was lost over time, and now, those who seek the stag might be searching for more than they realize. They say that to perform the ritual correctly, you might need to sell your soul.\" You decide to head into the forest, hoping to find the elusive stag. The whispers of the tavern still linger in your mind as you venture down the trail, the shadows of the trees growing deeper with each step.",
      "choices": {
        "1": {
          "text": "Meet the Stag and Perform the Trial",
          "response": "The stag appears, waiting for you. It looks at you with ancient eyes, its gaze piercing your very soul. You must prove your worth.",
          "next": "trial_encounter"
        },
        "2": {
          "text": "Attempt to Kill the Stag",
          "response": "You decide to try and kill the stag, seeing it as a challenge.",
          "next": "kill_stag_encounter"
        },
        "3": {
          "text": "Perform the Ritual",
          "response": "You decide to perform the ancient ritual of communion with the forest spirit.",
          "requirements": ["bundle_of_sage", "wood_charm"],
          "next": "perform_ritual"
        },
        "4": {
          "text": "If You Have Soul Essence, Perform an Advanced Ritual",
          "response": "You consider using your Soul Essence to perform an advanced version of the ritual, which could grant you power—or risk losing yourself in the process.",
          "requirements": [
            "soul_essence"
          ],
          "next": "perform_advanced_ritual"
        }
      }
    },
    "perform_ritual": {
      "description": "You kneel in the clearing, the silver stag watching intently as though weighing your intent. You take out the ingredients the barkeep described: a bundle of sage, a small crystal vial filled with clear water, and a carved wooden charm shaped like an antler. The air grows heavy as you light the sage, letting the fragrant smoke rise into the canopy.\n\nAs the smoke thickens, you chant the words taught to you by the barkeep:\n\n\"Oh guardian of the wild, hear my plea,\nThrough leaf and root, I call to thee.\nFrom silver moon to ancient grove,\nReveal the truths only spirits know.\"\n\nThe clearing begins to glow faintly, the stag lowering its antlers toward you. A soft voice, resonating in your mind and heart, speaks:\n\n\"Seeker, you have shown respect to the old ways. Ask your question, and it shall be answered.\" \n\nYou sense the forest's presence enveloping you, waiting for your response.",
      "choices": {
        "1": {
          "text": "Ask for the stag's blessing.",
          "response": "You bow your head and request the stag's blessing. The stag steps forward, lowering its head, and with a graceful movement, breaks off a small shard of its antler. It gently places the fragment in your palm. As you grasp it, a surge of energy courses through you, filling you with vitality and clarity.",
          "inventory_add": "silver_antler_shard",
          "next": "ritual_outcome"
        },
        "2": {
          "text": "Ask for the location of hidden treasure.",
          "response": "You ask about hidden riches within the forest. The stag tilts its head, its eyes gleaming with knowing. It stamps its hoof once, and a small wisp of light appears, darting through the trees. You follow it to a hidden hollow, where a chest lies buried beneath a blanket of moss.\n\nInside, you find ancient coins, a couple of gemstones, and a small silver ring with intricate carvings.",
          "inventory_add": ["sapphire", "emerald", "silver_ring"],
          "gold": 100,
          "next": "ritual_outcome"
        },
        "3": {
          "text": "Ask for the forest's power.",
          "response": "You request the forest's ancient power. With a graceful nod, the Stag lowers its head, its antlers glowing with an ethereal light, and from the depths of the forest's heart, it presents Verdant, a bow symbolizing the ancient power of the woods, now entrusted to you.",
          "inventory_add": "verdant",
          "next": "ritual_outcome"
        }
      }
    },
    "perform_advanced_ritual": {
      "description": "You venture into the forest, ready to perform the advanced ritual using your Soul Essence. The forest feels different, more alive, and as you gather the required items, you feel an eerie connection to the spirits of the woods. Once you have everything, you head to the sacred glade to perform the advanced ritual.\nHolding the Soul Essence aloft, you chant the incantation, each word resonating with an otherworldly power. The circle begins to glow, silver light spilling out and illuminating the trees. A pulse of energy ripples outward, and the forest falls silent.\nMoments later, a figure emerges from the light—a majestic stag, its silvery form shimmering like moonlight incarnate. Its eyes meet yours, ancient and wise, as it lowers its head in quiet acknowledgment of your call.\nThe ritual is complete.",
      "choices": {
        "1": {
          "text": "Ask for the stag's blessing",
          "response": "You bow your head and request the stag's blessing. The stag steps forward, lowering its head, and with a graceful movement, breaks off a small shard of its antler. It gently places the fragment in your palm. As you grasp it, a surge of energy courses through you, filling you with vitality and clarity.\n",
          "inventory_add": "silver_antler_shard",
          "next": "advanced_ritual_outcome"
        },
        "2": {
          "text": "Ask for the location of hidden treasure.",
          "response": "You ask about hidden riches within the forest. The stag tilts its head, its eyes gleaming with knowing. It stamps its hoof once, and a small wisp of light appears, darting through the trees. You follow it to a hidden hollow, where a chest lies buried beneath a blanket of moss.\nInside, you find a crystalline dagger, its blade forged from a rare material that hums with the power of the forest, and a cloak woven from moonlight and shadow, granting you the ability to blend into the surroundings as if part of the very woodland itself.\n",
          "inventory_add": [
            "fangroot_dagger",
            "moonlight_cloak"
          ],
          "next": "advanced_ritual_outcome"
        },
        "3": {
          "text": "Ask for the forest's secrets.",
          "response": "You request the forest's ancient secrets. The stag regards you solemnly before speaking in your mind:\n\"The trees whisper of paths lost to time. Seek the elder oak near the waterfall, and listen to its song. But beware—the deeper truths carry great risk.\"\nYou sense a surge of knowledge, visions of hidden groves and forgotten ruins flashing through your mind. You have gained the Knowledge of the Forest.",
          "inventory_add": [
            "knowledge_of_the_forest"
          ],
          "next": "advanced_ritual_outcome"
        }
      }
    },
    "trial_encounter": {
      "description": "The silver stag stands before you, its glowing eyes fixed on you with unwavering focus. Without a word, it raises its head, and from the surrounding mist, dark figures begin to materialize—wraith-like guardians summoned to test your strength. Their hollow eyes lock onto you, and a cold chill fills the air. Stag: (its voice echoing in your mind): \"Only those who prove their worth can pass. Defeat my guardians, or turn back.\"",
      "choices": {
        "1": {
          "text": "Prove Your Worth in the Trial",
          "response": "You take the stag's challenge, determined to prove yourself.",
          "combat": ["wraith","wraith"],
          "next": "trial_outcome"
        },
        "2": {
          "text": "Turn back",
          "response": "You give in to fear as you are faced with this majestic ethereal creature.",
          "next": "adventure_guild"
        }
      }
    },
    "kill_stag_encounter": {
      "description": "You raise your weapon against the stag. Its eyes flash with a mix of sorrow and ancient power. Before you can strike, the stag vanishes into the trees, leaving you with only the sense that you've lost something important.",
      "choices": {
        "1": {
          "text": "Return to the Tavern",
          "response": "You feel a heavy weight in your heart, but you decide to return to the tavern.",
          "next": "tavern_return"
        }
      }
    },
    "ritual_outcome": {
      "description": "The ritual unfolds in front of you. The forest's power surges through you, filling you with energy—or draining you, depending on your actions. What you gain or lose from this experience will shape your future.",
      "choices": {
        "1": {
          "text": "Leave the Forest",
          "response": "The ritual is complete, and you leave the forest with the feeling that something has changed within you.",
          "next": "tavern_return"
        }
      }
    },
    "advanced_ritual_outcome": {
      "description": "The power of the advanced ritual overwhelms you, the Soul Essence binding with the forest's power. Something ancient stirs in the woods. Your fate is now tied to the forest's will.",
      "choices": {
        "1": {
          "text": "Leave the Forest",
          "response": "You leave the forest, the echoes of the ritual still reverberating through your being.",
          "next": "tavern_return"
        }
      }
    },
    "trial_outcome": {
      "description": "You have defeated the wraiths and succeeded in completing the Stag's trial. It steps towards you, its stance more passive than before. Stag: \"For your success you shall be rewarded with a treasure from the forgotten realm.\" A blinding white light appears above you and you feel a small thump at your feet. You pick up a small deep blue ring, with white stones encircling its circumference. Looking up from your spoils, you can see the stag turn and disappear into the thick foliage of the forest.",
      "choices": {
        "1": {
          "text": "Leave the Forest",
          "response": "You leave the forest, in awe of the astonishing power you have observed",
          "inventory_add": [
            "forgotten_ring"
          ],
          "next": "tavern_return"
        }
      }
    },
    "tavern_return": {
      "description": "You return to the tavern, the firelight welcoming you back. But the stories of the stag still haunt your thoughts, and you know that your journey has only just begun.",
      "choices": {
        "1": {
          "text": "Relax and Rest",
          "response": "You sit down by the fire, resting for the night as the memories of your encounter linger in your mind.",
          "health": 5,
          "next": "adventure_guild"
        }
      }
    },
    "abandoned_church": {
      "description": "As you walk along the empty road, the sun begins to dip low in the sky, casting long shadows across the barren landscape. After hours of travel with no signs of civilization, you come across a strange sight—a tall, old church standing alone in the middle of nowhere. It looks out of place, the crumbling stone walls covered in ivy and moss. The tall spire reaches up into the sky, and the stained-glass windows, though cracked, still show faint traces of their former vibrant colors. There are no other buildings in sight, and the surrounding grounds are eerily quiet, save for the wind whispering through the trees. The large wooden doors of the church stand slightly ajar, as if inviting you in. A feeling of unease settles over you, but something about the place calls you forward, drawing you closer to its shadowed interior.",
      "choices": {
        "1": {
          "text": "Enter the church",
          "response": "You push open the heavy wooden doors and step inside. The air inside is musty, and the faint smell of incense lingers, as if the church had once been in use long ago. The grand interior is dimly lit, with dust motes floating lazily in the shafts of light that filter through the broken windows.",
          "next": "read_book"
        },
        "2": {
          "text": "Investigate the surrounding grounds.",
          "response": "You walk around the perimeter of the church, scanning the overgrown yard.",
          "next": "investigate_abandoned_crypt"
        },
        "3": {
          "text": "Leave the church behind you",
          "response": "You decide not to disturb the peace of this place and continue on your way.",
          "next": "adventure_guild"
        }
      }
    },
    "read_book": {
      "description": "At the far end of the room, an altar stands, draped in tattered cloths. As you approach the altar, you notice a large, worn book lying on it—its pages yellowed with age.",
      "choices": {
        "1": {
          "text": "Read the book",
          "response": "You open the heavy tome, its pages creaking under your touch. The words inside are written in an ancient, almost forgotten language, but some of the text is still legible. ",
          "next": "read_book_further"
        },
        "2": {
          "text": "Leave the Church",
          "response": "You quickly back away from the altar, feeling a sense of dread building in your chest. The whispers cease as soon as you step out of the church, but the eerie feeling lingers. The doors slam shut behind you, leaving you standing in the stillness of the yard. For a moment, you consider leaving, but something urges you to explore the grounds further.",
          "next": "investigate_abandoned_grounds"
        }
      }
    },
    "investigate_abandoned_grounds": {
      "description": "The grounds are scattered with old tombstones, their engravings faded beyond recognition. Some of the gravestones are broken or tilted at odd angles, and a few look as though they've been disturbed recently. There's an unsettling feeling here, as though the dead may not rest easy. At the edge of the yard, you notice an odd stone structure—perhaps a crypt or a mausoleum. It's partially buried under vines, but you can make out the faint shape of a door.",
      "choices": {
        "1": {
          "text": "Explore the crypt.",
          "response": "You make you way towards the ruined crypt",
          "next": "investigate_abandoned_crypt"
        },
        "2": {
          "text": "Leave the grounds entirely",
          "response": "You make your way out of the old church grounds, deciding it is best to not investigate the eerie place further.",
          "next": "adventure_guild"
        }
      }
    },
    "read_book_further": {
      "description": "You feel a strange compulsion to continue reading, even as the whispers grow louder. The book describes how Drakthul was bound within the church's foundation, its power sealed away by an ancient order. However, the ritual that sealed it also made the church a place of great power, drawing those sensitive to magic. The last entry in the book is cryptic: \"Drakthul waits beneath the altar. It seeks a soul to awaken it.\"",
      "choices": {
        "1": {
          "text": "Investigate the altar.",
          "response": "When you turn, the altar appears different—an unnatural darkness is creeping from the cracks in the floor, swirling around the base of the altar. The whispers turn into a guttural growl, and the air becomes thick with the presence of something malevolent.",
          "next": "drakthul_altar"
        },
        "2": {
          "text": "Leave the church immediately.",
          "response": "You quickly back away from the altar, feeling a sense of dread building in your chest. The whispers cease as soon as you step out of the church, but the eerie feeling lingers. The doors slam shut behind you, leaving you standing in the stillness of the yard. For a moment, you consider leaving, but something urges you to explore the grounds further.",
          "next": "investigate_abandoned_grounds"
        }
      }
    },
    "investigate_abandoned_crypt": {
      "description": "The stone door to the crypt creaks open, revealing a narrow, dark passage leading down into the earth. The air is thick and stale, with the smell of mildew and decay. At the end of the passage is a small chamber, filled with sarcophagi and stone coffins. One of the coffins lies partially open, as if disturbed recently. As you examine the crypt, you notice strange symbols etched into the walls. In the center of the room, an ornate stone pedestal holds a dusty, old key.",
      "choices": {
        "1": {
          "text": "Take the key.",
          "response": "Suddenly, a cold gust of wind blows through the crypt, and the chamber trembles. A low growl rumbles from the shadows, and the faint outlines of figures begin to materialize, their eyes glowing faintly in the dark.",
          "inventory_add": [
            "shackled_choir_key"
          ],
          "combat": "skeleton",
          "next": "adventure_guild"
        },
        "2": {
          "text": "Leave the crypt",
          "response": "You step away from the crypt, the heavy air around it lifting slightly as you leave. The shadows of the surrounding trees stretch longer, quietly reclaiming the ground.",
          "next": "adventure_guild"
        }
      }
    },
    "drakthul_altar": {
      "description": "You step closer to the altar, drawn to the swirling darkness beneath it. As you touch the stone surface, the ground trembles, and the darkness pulses violently. A voice—low and guttural—echoes through the church: \"You have awakened me...\"",
      "choices": {
        "1": {
          "text": "Attempt to seal the altar once more.",
          "response": "Suddenly, the church shakes violently, as though something beneath it stirs. The shadows ripple and writhe, coiling around you, their icy tendrils brushing your skin. The air grows heavy with an oppressive power, and the whispers swell into a deafening roar. Despite the mounting dread, you stand your ground, drawn by the undeniable pull of the altar's malevolent energy. The church is no longer a sanctuary but a vortex of unleashed power, its curse now fully awakened and beyond control.",
          "combat": "drakthul",
          "next": "darkthul_altar_outcome"
        },
        "2": {
          "text": "Flee the church immediately.",
          "response": "Overwhelmed by the suffocating darkness and the roar of unseen whispers, you turn and flee, the echoing sound of your footsteps swallowed by the chaos behind you.",
          "next": "adventure_guild"
        }
      }
    },
    "drakthul_altar_outcome": {
      "description": "You stand victorious, the oppressive darkness slowly fading as the altar's power wanes. The shadows that once threatened to consume you retreat, their grip on the church weakening. The ground stops trembling, and the ominous voice falls silent. The curse, though powerful, has been broken. As the last remnants of darkness dissipate, you notice the gleam of silver chains, newly formed from the very shadows that once sought to drag you into the earth. The church, though scarred, is no longer a place of torment. You've banished the ancient evil that lurked beneath, restoring a fragile peace.",
      "choices": {
        "1": {
          "text": "Leave the church, having conquered evil.",
          "response": "As you leave the ruins behind, you know the battle has been won, but the price of meddling with such dark forces may linger forever.",
          "inventory_add": [
            "silver_chains"
          ],
          "next": "adventure_guild"
        }
      }
    },
    "burnt_forest": {
            "description": "You step into the remains of a forest, the air heavy with the acrid scent of ash. Blackened tree trunks rise around you like charred skeletons, their brittle remains crunching underfoot. The silence is deafening, broken only by the faint whisper of wind through the ruins.\nIn the distance, a faint shape emerges from the haze, a solitary shrine, untouched by the devastation, standing like a ghostly sentinel amidst the destruction.\n",
            "choices": {
                "1": {
                  "text": "Explore the charred forest.",
                  "response": "You decide to explore the forest.\n",
                  "next": "charred_forest_exploration"
                },
                "2": {
                  "text": "Leave the forest.",
                  "response": "You decide to leave the forest behind.\n",
                  "next": "adventure_guild"
                },
                "3": {
                  "text": "Walk towards the shrine.",
                  "response": "You walk toward the mysterious shrine.\n",
                  "next": "burnt_shrine"
                }
            }
        },
    "charred_forest_exploration": {
            "description": "Walking through a burnt forest feels like crossing an ancient, forgotten world. The trees, stripped of their leaves and covered in soot. The scent of smoke still lingers in the air, mixing with the earthy scent of charred wood. The ground is soft, powdery with ash, and every step seems to stir up a ghostly silence. In the distance, a small burrow is nestled at the base of a burnt tree, a quiet reminder that, despite the destruction, life still finds a way to shelter itself.\n",
            "choices": {
                "1": {
                  "text": "Explore the burrow.",
                  "response": "You crouch down and crawl into the burrow.\n",
                  "next": "burnt_burrow"
                },
                "2": {
                  "text": "Explore the shrine.",
                  "response": "You turn toward the shrine in the distance.\n",
                  "next": "burnt_shrine"
                }
            }
        },
    "burnt_burrow": {
            "description": "The burrow is tucked away beneath the gnarled roots of a charred tree, the entrance framed by dark, twisted wood. The ground around it is soft, the earth disturbed, and small paw prints lead in and out, suggesting frequent visits. Inside, the space is cramped but cozy, lined with dried leaves and soft moss. As you crouch down to peer inside, something catches your eye—a small, worn wooden charm, intricately carved with delicate swirls, resting near the entrance. A few gold coins glint softly in the dim light, their surface tarnished but still bright enough to catch your attention.\n",
            "choices": {
                "1": {
                  "text": "Take the items.",
                  "response": "You collect the coins and the charm.\n",
                  "inventory_add": ["wood_charm"],
                  "gold": 2,
                  "next": "burnt_shrine"
                },
                "2": {
                  "text": "Leave the items and explore the shrine.",
                  "response": "You leave the items untouched and head toward the shrine.\n",
                  "next": "burnt_shrine"
                }
            }
        },
    "burnt_shrine": {
            "description": "The shrine is a small, weathered stone alcove, its edges covered in soot and ash from the surrounding burn. At the center, there's a painting of a human figure—dressed in simple, tattered robes—offering something to a divine figure depicted in flames. The god is rendered in vivid, fiery colors, with swirling orange and red hues surrounding their form, creating a halo of intense light. The human figure is kneeling, eyes lowered, holding out a small bundle of herbs and flowers, which smolder with wisps of smoke. The painting captures a moment of devotion and reverence, despite the harsh conditions of the forest. The heat from the nearby fire offering seems to shimmer against the painting's surface, adding to the mystical aura of the scene.\n",
            "choices": {
                "1": {
                  "text": "Pay your offerings to the god.",
                  "response": "You decide to make an offering to the god.\n",
                  "next": "fire_offering"
                },
                "2": {
                  "text": "Ramshackle the shrine for any loot left behind.",
                  "response": "You search the shrine and find a little gold and a silver cross.\n",
                  "inventory_add": ["silver_cross"],
                  "gold": 10,
                  "next": "adventure_guild"
                },
                "3": {
                  "text": "Turn around and leave.",
                  "response": "You decide to leave the shrine behind.\n",
                  "next": "adventure_guild"
                }
            }
        },
    "fire_offering": {
        "description":
            "You decide to build a bonfire from the surrounding wood. Now, you must decide the time for your offering.",
        "choices": {
            "1": {
              "text": "Dusk.",
              "response": "You decide to wait until dawn. As the first light of dawn touches the remains of the fire, the smoke clears to reveal a wooden torch.\n",
              "inventory_add": ["wooden_torch"],
              "next": "adventure_guild"
            },
            "2": {
              "text": "Noon.",
              "response": "You decide to wait until noon. As the flames of the offering reach their peak, the fire intensifies and a breastplate with intricate details materializes from the embers, its molten surface glowing faintly, as if it had been shaped by the very heat of the ritual.\n",
              "inventory_add": ["flameforged_breastplate"],
              "next": "adventure_guild"
            },
            "3": {
              "text": "Late afternoon.",
              "response": "You decide to wait until later in the afternoon. As the last embers of the offering die down, a shard of obsidian emerges from the ashes, its dark surface gleaming with an unnatural sheen, as if forged by the very flames that consumed the offering.\n",
              "inventory_add": ["obsidian"],
              "next": "adventure_guild"
            },
            "4": {
              "text": "Dawn.",
              "response": "You decide to wait until dusk. As the sun dips below the horizon and the last embers of the offering flicker in the fire, the flames rise higher, and from the heart of the blaze, an iron dagger materializes, its blade forged from the fire itself, still glowing faintly with heat.\n",
              "inventory_add": ["iron_dagger"],
              "next": "adventure_guild"
            },
            "5": {
              "text": "Midnight.",
              "response": "You decide to wait until midnight. The fire flickers out with a cold hiss, leaving the air heavy and still. Instead of a blessing, the shadows grow deeper, and an unsettling silence fills the clearing. The offering has been rejected, and a dark presence seems to linger in the air.\n",
              "next": "adventure_guild"
            }
        }
        },
    "stonehaven_goblin_camp": {
      "description": "You arrive in Stonehaven, a bustling mining town nestled in the shadow of the mountains. As they wander through the cobbled streets, they are approached by a stern-looking guard in the mayor's colors.\n\"You're an adventurer, aren't you?\" he asks. \"Mayor Garrek has a task of utmost importance and little time to waste. Follow me.\"\nInside the mayor's chambers, the room is dominated by a large oak desk, maps and ledgers strewn across its surface. Mayor Garrek, a stout man with a bristling beard, looks up, his face lined with worry.\n\nMayor Garrek: \"Adventurer, our town is under siege—not by an army, but by those blasted goblins. They've set up a camp in the woods just north of here and have been raiding our caravans. We can't send the militia; they're already stretched too thin guarding the mines. That's where you come in.\"",
      "choices": {
        "1": {
          "text": "Accept the Quest.",
          "response": "Garrek's expression softens with relief. He retrieves a crudely drawn map from his desk and hands it to you.\nMayor Garrek:\"This will lead you to their camp. Be careful; goblins may be small, but they’re cunning. If there is a chieftain among them, he won’t go down easily. Deal with them, and I’ll see to it that you’re properly rewarded.\"\n",
          "next": "stonehaven_goblin_camp_outskirts"
        },
        "2": {
          "text": "Refuse the Quest.",
          "response": "The mayor watches you as you make your way back towards the door, and as you are about to leave the room he calls you back.\n Mayor Garrek:\"It seems I will have to make this quest more worthwhile for you. I will increase its reward, and even allow you to choose an item from our humble but precious vault. That is how desperate I am.\"\n",
          "next": "higher_offer_stonehaven"
        }
      }
    },
    "higher_offer_stonehaven": {
      "description": "Mayor Garrek, desperate to protect Stonehaven, sweetens the deal. You are the chance to choose a rare treasure from the town's vault if you accept the quest.\n",
      "choices": {
        "1": {
          "text": "Accept the quest with the higher reward.",
          "response": "You nod firmly, sealing your agreement.\nMayor Garrek: \"Stonehaven thanks you, adventurer. The goblin camp lies to the northeast. Return to me when the deed is done.\"\n",
          "next": "stonehaven_higher_reward"
        },
        "2": {
          "text": "Refuse, even with the higher reward.",
          "response": "You shake your head, even with the offer of greater riches. Garrek sighs deeply, his disappointment evident.\nMayor Garrek: \"So be it. May the gods protect us...\"\nYou leave Stonehaven, knowing the town must fend for itself.",
          "next": "adventure_guild"
        }
      }
    },
    "stonehaven_higher_reward": {
      "description": "You follow the mayor’s guard down a narrow staircase leading to a small, dimly lit vault beneath the town hall. The air is cool and musty, and the faint sound of footsteps echoes off the stone walls. The guard stops in front of an unassuming wooden chest, secured with a heavy lock.\nGuard: \"The mayor has authorized you to take your pick from here. Choose wisely, as this is all he has to offer for your troubles.\"\nThe vault is filled with a few scattered items—gold coins, a handful of weapons, and a small collection of rare trinkets.\n",
      "choices": {
        "1": {
          "text": "Some gold coins.",
          "response": "You pick up some gold coins from a pile near the entrance.\n",
          "gold": 25,
          "next": "stonehaven_goblin_camp_outskirts"
        },
        "2": {
          "text": "A sturdy looking pickaxe.",
          "response": "You wonder why a pickaxe would be in the town's vault, nontheless its a good tool to have.",
          "inventory_add": "pickaxe",
          "next": "stonehaven_goblin_camp_outskirts"
        },
        "3": {
          "text": "A silver medallion with a fox depicted on it.",
          "response": "You open a small box within which lies a silver medallion with the image of a fox in mid-leap, surrounded by runes that shimmer faintly, on a bed of velvet.",
          "inventory_add": "fox_grace_medallion",
          "next": "stonehaven_goblin_camp_outskirts"
        }
      }
    },
    "stonehaven_goblin_camp_outskirts": {
      "description": "The air grows tense as you near the goblin camp. Twisted trees loom overhead, their branches clawing at the gray sky. The acrid smell of smoke and decay hangs thick, mingled with the faint sound of guttural voices and raucous laughter.\nCrude bone totems mark the boundary, and a rickety wooden palisade surrounds the camp, dotted with gaps and poorly built watchtowers. Beyond the walls, flickering firelight reveals the shadowy outlines of goblins bustling about in chaotic disarray.\n You take a moment to decide on the best approach to complete this quest.\n",
      "choices": {
        "1": {
        "text": "Stealth approach",
        "response": "You decide to sneak into the camp.\n",
        "next": "stonehave_camp_stealth"
        },
        "2": {
          "text": "Direct approach",
          "response": "You decide to enter through the front gates.\n",
          "next": "stonehaven_camp_front_gate"
        },
        "3": {
          "text": "Diplomatic approach",
          "response": "You walk towards the front gate holding a white flag, wondering if they recognise this sign.\n",
          "next": "stonehaven_camp_meeting"
        }
      }
    },
    "stonehave_camp_stealth": {
      "description": "You crouch low, moving carefully through the shadows cast by flickering firelight. The goblins’ guttural chatter and the clinking of crude weapons mask your footsteps. You spot guards stationed near gaps in the palisade, their attention flickering between laziness and vigilance. One misstep could spell disaster.\nThree possible routes lead into the camp.\n",
      "choices": {
        "1": {
          "text": "The narrow ridge",
          "response": "Loose stones clatter down the slope, and a goblin looks up. You are spotted and the goblins overwhelm you and bring you to the chieftain's barrack.\n",
          "next": "failed_stealth"
        },
        "2": {
          "text": "The dense thicket",
          "response": "You push through the thorny brush, careful to avoid making noise. The goblins don’t seem to notice your movements.\n",
          "next": "stonehave_camp_stealth_2"
        },
        "3": {
          "text": "The creek bed",
          "response": "You stumble on slick rocks, splashing loudly. You are spotted and the goblins overwhelm you and bring you to the chieftain's barrack.\n",
          "next": "failed_stealth"
        }
      }
    },
    "stonehave_camp_stealth_2": {
      "description": "As you close in, you spot two goblins chatting near the campfire. Another patrol circles the area. You need to pick the right distraction to slip by.\n",
      "choices": {
      "1": {
        "text": "Throw a rock to distract them",
        "response": "The goblins hear the noise but investigate cautiously, catching sight of you as you move. You are dragged back towards the chieftain's hut.\n",
        "next": "failed_stealth"
      },
      "2": {
        "text": "Stay motionless and hidden until the patrol cycles away.",
        "response": "You stay still and silent, watching as the patrol moves away. The path ahead is clear.\n",
        "next": "stonehave_camp_stealth_3"
      },
      "3": {
        "text": "Mimic the sound of an animal to lure them away.",
        "response": "They look toward the sound but remain suspicious, increasing their alertness and spotting you when you move. You are dragged back towards the chieftain's hut.\n",
        "next": "failed_stealth"
      }
    }
  },
    "stonehave_camp_stealth_3": {
      "description": "You’ve made it close to the heart of the camp, where the Goblin Chieftain’s tent stands. However, one last obstacle lies in your path—a lone goblin stands guard.\n",
      "choices": {
        "1": {
          "text": "Sneak up and take him Out silently.",
          "response": "You creep up behind the goblin, dispatching them silently. The path to the Chieftain is open.\n",
          "next": "stealth_success"
        },
        "2": {
          "text": "Wait for him to move away.",
          "response": "The goblin lingers, growing suspicious of your presence. The goblin calls for reinforcements, and the alarm is raised.",
          "next": "failed_stealth"
        },
        "3": {
          "text": "Divert his attention with a noise.",
          "response": "The goblin alerts others when they hear the sound, reinforcements arrive and knock you out.\n",
          "next": "failed_stealth"
        }
      }
    },
    "failed_stealth": {
      "description": "The moment you’re shoved into the Chieftain’s hut, the door slams shut behind you with a heavy thud. The inside is dimly lit by the flickering glow of a fire in a stone pit, casting eerie shadows on the walls. Goblin warriors stand at attention, their eyes glinting with curiosity and malice.\n\nAt the far end of the hut sits Gruknar, the Goblin Chieftain, towering in his furs and armor. He raises a hand, signaling for the guards to release you. The goblins step back, their hands still on their weapons, watching the scene unfold with interest.\n\nGoblin Chieftain (Gruknar):\n\"You’re brave, human... or foolish. Tell me, why are you sneaking around my camp?\"\n",
      "choices": {
        "1": {
          "text": "Bluff with confidence",
          "response": "Player: \"I was sent by the mayor of Stonehaven to negotiate. I come with an offer.\"\n",
          "next": "stonehaven_camp_offer"
        },
        "2": {
          "text": "Plead for mercy",
          "response": "Player: \"Please, I didn’t mean to intrude. I’ll leave. Just spare me.\"\nGoblin Chieftain: \"Mercy? We goblins don’t give mercy, human. But I may have use for you.\"",
          "next": "stonehaven_camp_execution"
        },
        "3": {
          "text": "Challenge the Chieftain’s authority",
          "response": "Player: \"You think you can control me? Let me go, or I’ll make you regret it!\"\n",
          "next": "Gruknar_duel"
        }
      }
    },
    "stonehaven_camp_execution": {
      "description": "You are dragged towards a high post near the centre of the camp. The fear of what is coming is making you shiver in the warm summer weather. You feel yourself being impaled into a giant stake, the pain so insufferable you go numb.\n",
      "choices": {
        "1": {
          "text": "Pray.",
          "response": "You say your last prayer as you feel death cling to you.\n",
          "death": "",
          "next": ""
        }
      }
    },
    "stealth_success": {
      "description": "By the time you reach the Chieftain’s hut, you've managed to incapacitate several sentries without raising the alarm. The camp is quieter now, and the goblins are none the wiser to the danger lurking in their midst.\nYou enter the Chieftain’s hut undetected, finding Gruknar deep in thought, surrounded by maps and weapons. The goblin looks up in surprise but quickly masks his shock with a grin.\n\nGoblin Chieftain (Gruknar):\n\"You! Impressive... but foolish. You’ve come here to kill me, yes?\"\nA tense silence fills the air as Gruknar stands, gripping his flaming axe.\n",
      "choices": {
        "1": {
          "text": "Challenge him to combat.",
          "response": "You challange the Chieftain to a duel.\n",
          "next": "Gruknar_duel"
        },
        "2": {
          "text": "Persuade the Chieftain to leave. A little gold should do the trick.\n",
          "response": "Player:\"I can offer you a fair amount of gold for you to relocate to a less populated area.\"\n",
          "next": "Gruknar_taken_offer"
        }
      }
    },
    "stonehaven_camp_front_gate": {
      "description": "You make your way toward the goblin camp, the night air thick with the smell of smoke and the sounds of distant laughter and shouting. As you near the entrance to the camp, you spot several goblin sentries standing at attention, their eyes scanning the surrounding woods for intruders. There’s no hiding now—they’ve seen you, and they’re ready to fight.\n",
      "choices": {
        "1": {
          "text": "Charge forward.",
          "response": "Without hesitation, you draw your weapon and charge forward, your boots crunching on the dry ground as you break from cover and charge directly into the heart of the goblin camp. Your sudden approach sends shockwaves through the camp, and within moments, several goblins are rushing to meet you, weapons drawn and war cries echoing into the night.\n",
          "combat": ["goblin_guard","goblin_guard","goblin_archer","goblin_archer","goblin_barbarian"],
          "next": "combat_success"
        }
      }
    },
    "combat_success": {
      "description": "After defeating the initial wave of goblins, the camp falls eerily silent. As the last of the goblins retreat into the forest, a deep, guttural laugh echoes from the largest tent in the camp. The flap parts, and Gruknar, the Goblin Chieftain, emerges. Towering over his kin, he’s clad in a patchwork of stolen armor and wields a massive, flaming axe that glows ominously in the dim light of the campfires.\nGoblin Chieftain (Gruknar): \"Impressive, human. You’ve got guts. But if you think you can walk in here and take what’s mine, you’ve got another thing coming. Let’s settle this...like warriors.\"\n",
      "choices": {
       "1": {
         "text": "Challenge him to a duel.",
         "response": "You agree to the Chieftain's duel, walking up towards him as he readies his axe.\n",
         "next": "Gruknar_duel"
       },
       "2": {
         "text": "Avoid bloodshed and attempt to strike a deal with the goblin leader.",
         "response": "Goblin Chieftain (Gruknar): \"A deal, you say? Hmph. I’m listening, human, but I ain’t letting you walk away empty-handed.\"\n",
         "next": "Gruknar_taken_offer"
       },
       "3": {
         "text": "Attempt to intimidate the Goblin Chieftain.",
         "response": "Goblin Chieftain (Gruknar): \"Bah! Fine! You win this time, human. But we’ll meet again!\"\nThe chieftain retreats with his tribe, abandoning the camp. You’re left to loot the camp without further resistance. You walk back and enter the Chieftain's tent, there in the corner lies a small chest. You open it to find a small amount of gold and a black book, with a symbol on the front you've never seen before.\n",
         "inventory_add": ["goblin_chestplate","goblin_dagger","goblin_helmet","tome_of_abyss"],
         "next": "stonehaven_camp_intimidation_outcome"
       }
      }
    },
    "stonehaven_camp_meeting": {
      "decription": "You stride into the camp openly, hands raised to show you mean no harm. The goblins, initially startled, quickly form a defensive ring, their crude weapons aimed at you. From the largest tent, a guttural voice bellows:\nGoblin Chieftain (Gruknar): \"Who dares walk into my camp uninvited? Speak quickly before I carve you into pieces!\"\nA towering goblin steps out, his flaming axe resting casually on his shoulder. His yellow eyes narrow as he sizes you up.\n",
      "choices": {
        "1": {
          "text": "Offer the goblins a deal.",
          "response": "Player:\"I can offer you a fair amount of gold for you to relocate to a less populated area.\"\n",
          "next": "Gruknar_taken_offer"
        },
        "2": {
          "text": "Attack Gruknar without warning.",
          "response": "Without warning you strike at the Chieftain's throat, and manage to kill him somehow. In their grief the rest of the goblins attack you.\n",
          "combat": ["goblin_guard","goblin_archer","goblin_guard","goblin_barbarian","goblin_archer"],
          "next": "combat_outcome"
        }
      }
    },
    "Gruknar_taken_offer": {
      "description": "Goblin Chieftain (Gruknar):\"I will take a fair amount of gold to move away.\"\n",
      "choices": {
        "1": {
          "text": "Pay off the goblins.",
          "response": "You hand over a small pouch of gold to the chieftain.Goblin Chieftain (Gruknar):\"I like the look of your gold human, we will leave the forest by daylight tomorrow. We goblins keep our word, unlike those human leaders you follow. I will give you a small token of peace, to help you in the future, let other goblin tribes know you are a fair human.\"\n",
          "inventory_add": "goblin_peace_offering",
          "gold": -50,
          "next": "stonehaven_camp_offer_outcome"
        }
      }
    },
    "Gruknar_duel": {
      "description": "The goblins form a wide circle around you and Gruknar, jeering and pounding their weapons against the ground in a steady rhythm. The air is thick with the stench of smoke and sweat, and the flickering light of the campfires casts long, shifting shadows across the crude battleground.\nGruknar steps forward, his flaming axe igniting with a roar as he swings it in a show of strength. His yellow eyes gleam with savage delight, and his sharp teeth glint as he grins menacingly.\nGoblin Chieftain (Gruknar): \"You wanted a fight, human? You’ll regret crossing me. Let’s see if you’re as brave as your words!\"\n",
      "choices": {
        "1": {
          "text": "Duel",
          "response": "You charge towards the Chieftain, hoping to win.\n",
          "combat": "goblin_chieftain_gruknar",
          "death_msg": "Goblin Chieftain (Gruknar):\"Hah! You’re strong, human, but not strong enough!\"\n",
          "next": "duel_outcome"
        }
      }
    },
    "combat_outcome": {
      "description": "Bodies of goblin warriors and shamans are strewn across the clearing, and the acrid scent of burning tents fills the air. The ground beneath your feet is scorched and littered with discarded weapons.\nAmid the wreckage, a few surviving goblins cower, their eyes wide with fear. They dare not attack, instead retreating into the shadows of the forest.\nYou stand victorious, bloodied but triumphant. As you survey the aftermath, your gaze falls upon the chieftain’s hut—a crude structure of bone and hide, still intact. A faint growl emanates from within, and you know the fight isn’t over yet.\n",
      "choices": {
        "1": {
          "text": "Loot the camp.",
          "response": "You walk through the camp picking up anything that look useful. You walk back and enter the Chieftain's tent, there in the corner lies a small chest. You open it to find a small amount of gold and a black book, with a symbol on the front you've never seen before.\n",
          "inventory_add": ["goblin_dagger","goblin_helmet","tome_of_abyss"],
          "gold": 23,
          "next": "stonehaven_camp_death_outcome"
        }
      }
    },
    "duel_outcome": {
      "description": "With one final strike, you end Gruknar’s life. The goblins watch in stunned silence before dropping their weapons and fleeing into the woods.\nThe Goblin Chieftain’s reign of terror is over, and with his death, the camp is dismantled. The threat to Stonehaven is no more.\n",
      "choices": {
        "1": {
          "text": "Loot the camp.",
          "response": "You walk through the camp picking up anything that look useful. You walk back and enter the Chieftain's tent, there in the corner lies a small chest. You open it to find a small amount of gold and a black book, with a symbol on the front you've never seen before.\n",
          "inventory_add": ["goblin_dagger","goblin_bow","tome_of_abyss"],
          "gold": 23,
          "next": "stonehaven_camp_death_outcome"
        }
      }
    },
    "stonehaven_camp_death_outcome": {
      "description": "The journey back to Stonehaven is quiet, the weight of recent events hanging heavy in the air. The goblin threat has been dealt with, and the once-dangerous camp now lies in ruins.\nAs you approach the gates, townsfolk gather, their faces a mixture of relief and curiosity. Whispers ripple through the crowd as they take in your battle-worn appearance and the grim trophies of your victory.\nIn the mayor’s office, Garrek waits, his expression tense but hopeful.\nMayor Garrek:\"You’ve returned. Tell me, is it done?\"\nYou recount the events—the confrontation, the battle, and the resolution. Garrek listens closely, nodding as you finish.\nMayor Garrek:\"You’ve done well. The town owes you more than words can express. As promised, here is your reward.\"\nHe hands you a pouch of gold.\nThe townsfolk cheer as you leave the office, their gratitude palpable. Though the danger has passed, a sense of unease lingers—this victory feels like the beginning of something greater.\n",
      "choices": {
        "1": {
          "text": "Continue on your journey.",
          "response": "You start making your way back towards the guild.",
          "gold": 50,
          "next": "adventure_guild"
        }
      }
    },
    "stonehaven_camp_peace_outcome": {
      "description": "You step into the mayor's office, where Mayor Garrek is pacing with a scowl on his face. The tension in the room is palpable.\nMayor Garrek: \"Well? What happened? I expect answers, not excuses.\"\nYou explain that the goblins took the gold and moved away without further conflict.\nMayor Garrek: \"You paid them? Gold? To those filthy thieves?\" His face reddens in disbelief. \"And you think that’s a victory? You’ve just encouraged them! Now they’ll know they can extort us whenever they please.\"\nHe turns away, clearly frustrated, muttering to himself before glaring at you.\nMayor Garrek: \"You had a chance to deal with this the right way, but instead, you bought them off like some merchant trying to make a deal. You’ve made us look weak. You’ve made me look weak!\"\nHe takes a deep breath, trying to regain control, but the anger is still evident.\nMayor Garrek: \"I’ll clean up this mess, but don’t think for a second that your actions haven’t consequences.\"\n",
      "choices": {
        "1": {
          "text": "Continue on your journey.",
          "response": "You start making your way back towards the guild.",
          "gold": 50,
          "next": "adventure_guild"
        }
      }
    },
    "stonehaven_camp_intimidation_outcome": {
      "description": "The journey back to Stonehaven is quiet, the weight of recent events heavy in the air. The goblin threat has been dealt with, but the camp still stands, its leader intimidated into submission rather than eradicated.\nAs you approach the gates, townsfolk gather, their faces a mix of relief and curiosity. Whispers ripple through the crowd as they take in your battle-worn appearance and the grim trophies of your victory.\nIn the mayor’s office, Garrek waits, his expression tense but hopeful.\nMayor Garrek: \"You’ve returned. Tell me, is it done?\"\nYou recount the events—the confrontation, the intimidation, and the outcome. Garrek listens closely, his brow furrowing.\nMayor Garrek: \"I see. You’ve done well, but… I had hoped for a more final resolution. The goblins still remain, after all.\"\nDespite his words, he hands you a pouch of gold.\nThe townsfolk cheer as you leave the office, their gratitude palpable. Though the danger has passed, a sense of unease lingers—this victory feels like the beginning of something greater, something still unresolved.\n",
      "choices": {
        "1": {
          "text": "Continue on your journey.",
          "response": "You start making your way back towards the guild.",
          "gold": 50,
          "next": "adventure_guild"
        }
      }
    }
  }
}