{"items": {
    "weapons": {
  "swords": {
    "iron_sword": {
      "name": "Iron Sword",
      "description": "A simple, well-used sword with a steel blade and a leather-wrapped hilt. It shows signs of wear but remains sharp and balanced, reliable for basic combat. A practical weapon for any adventurer.",
      "stats": {
        "attackDmg": 10,
        "agility": 2
      },
      "rarity": "common",
      "price": 3,
      "attribute": "physical"
    },
    "excalibur": {
      "name": "Excalibur",
      "description": "The legendary sword of unmatched power. Its blade gleams with a radiant, otherworldly light, etched with ancient runes. The hilt is adorned with gold and precious gems, radiating an aura of divine authority. This is no ordinary weapon—its strike is destined to change the course of history.",
      "stats": {
        "attackDmg": 750
      },
      "rarity": "legendary",
      "price": 1000000000,
      "attribute": "holy"
    }
  },
  "spears": {
    "iron_lance": {
      "name": "Iron Lance",
      "description": "A sturdy, well-balanced lance with a long wooden shaft and a steel tip. The wood is worn from use, but it remains strong and reliable. The blade is simple, practical, and effective for mounted combat or thrusting. A dependable weapon, ideal for soldiers or adventurers seeking a reliable polearm.",
      "stats": {
        "attackDmg": 15,
        "critChance": 0.02
      },
      "rarity": "common",
      "price": 3,
      "attribute": "physical"
    }
  },
  "axes": {
    "fire_axe": "Fire Axe",
    "description": "A fearsome weapon with a blade perpetually engulfed in fiery flames. The axe's sturdy handle is wrapped in scorched leather, providing a firm grip. The flames flicker with an eerie intensity, making it both a tool and a weapon of destruction. It is said to have been forged in the heart of a volcano, giving it an unparalleled edge that can cut through wood, steel, and even stone with ease.\n",
    "stats": {
      "attackDmg": 30,
      "critChance": 0.03,
      "agility": 10
    },
    "rarity": "rare",
    "price": 50,
    "attribute": "fire",
    "skills": "berserk"
  },
  "daggers": {
    "iron_dagger": {
      "name": "Iron Dagger",
      "description": "A sturdier, well-balanced dagger with a sharp blade. It’s good for close combat or as a utility tool for cutting through ropes or small objects.",
      "stats": {
        "attackDmg": 7,
        "agility": 2,
        "critChance": 0.01
      },
      "rarity": "common",
      "price": 2,
      "attribute": "physical"
    },
    "goblin_dagger": {
      "name": "Goblin Dagger",
      "description": "A small, wickedly sharp dagger with a jagged, serrated edge. The handle is wrapped in rough leather, providing a decent grip for quick, precise strikes. This weapon is favored by goblins for its versatility, often used in stealth attacks or as a backup weapon. Its size and design make it ideal for stabbing between gaps in armor or slipping past guards unnoticed.\n",
      "stats": {
        "attackDmg": 5,
        "agility": 3,
        "critChance": 0.02
      },
      "rarity": "common",
      "price": 2,
      "attribute": "physical"
    },
    "fangroot_dagger": {
      "name": "Fangroot Dagger",
      "description": "This dagger seems to have grown rather than been forged, its blade formed from a crystalline root that gleams with a faint emerald hue. The hilt is wrapped in supple bark, and faint wisps of green mist emanate from the blade's edge. Each strike delivers a potent toxin, making the weapon as dangerous as it is beautiful.\n",
      "stats": {
        "attackDmg": 18,
        "agility": 5,
        "critChance": 0.02
      },
      "rarity": "rare",
      "price": 75,
      "attribute": "natural",
      "skill": "poison"
    }
  },
  "blunt_weapons": {
    "iron_mace": {
      "name": "Iron Mace",
      "description": "A heavy, blunt mace with a steel head and a wooden handle. The mace is well-crafted and sturdy, designed for crushing blows and armored opponents. The weight of the mace gives it considerable impact, making it a formidable weapon in close combat. A reliable choice for warriors or knights facing heavily armored foes.",
      "stats": {
        "attackDmg": 20
      },
      "rarity": "common",
      "price": 3,
      "attribute": "physical"
    }
  },
  "miscellaneous_weapons": {
    "wooden_torch": {
      "name": "Wooden Torch",
      "description": "A simple, unlit torch made from a stick wrapped in cloth. It can be lit to provide light for a short duration or used to start fires.",
      "stats": {
        "attackDmg": 8
      },
      "rarity": "common",
      "price": 1,
      "attribute": "fire"
    },
    "pickaxe": {
      "name": "Pickaxe",
      "description": "A sturdy tool with a sharp, reinforced metal head designed for breaking through rock and stone. The wooden shaft is weathered from years of use but still holds strong. This pickaxe is invaluable for miners, adventurers, or anyone who needs to break through tough terrain. The head is balanced to provide both power and precision when striking, ensuring each swing counts.\n",
      "stats": {
        "attackDmg": 4,
        "critChance": 0.02
      },
      "rarity": "common",
      "price": 32,
      "attribute": "physical",
      "skill": "pierce"
    }
  },
  "bows": {
    "goblin_bow": {
      "name": "Goblin Bow",
      "description": "A lightweight bow made of flexible wood with leather strings, favored by goblins for its quick draw and rapid-fire capability. Though not as powerful as larger bows, its arrows are often coated in poison, making even glancing hits dangerous. Ideal for stealth and hit-and-run tactics.\n",
      "stats": {
        "attackDmg": 7,
        "critChance": 0.2
      },
      "rarity": "common",
      "price": 20,
      "attribute": "natural",
      "skill": "poison"
    },
    "verdant": {
      "name": "Bow of Verdant",
      "description": "A beautifully crafted longbow, entwined with glowing vines. Forged in an ancient forest, it channels the power of nature, enhancing accuracy and imbuing arrows with the forest's energy. Ideal for those attuned to nature, it strikes with precision to strike down enemies with the force of the wild.\n",
      "stats": {
        "attackDmg": 150
      },
      "rarity": "exquisite",
      "price": 180,
      "attribute": "natural"
    }
  }
},
    "helmets": {
      "goblin_helmet": {
        "name": "Goblin Helmet",
        "description": "A simple yet effective helmet made of rough metal, often scavenged from fallen enemies or looted from abandoned ruins. It provides basic protection to the head and is adorned with small spikes, giving it a fearsome appearance. While not the most durable, it offers protection from minor blows, making it a practical choice for goblin warriors who rely on speed rather than resilience.\n",
        "stats": {
          "defense": 5
        },
        "rarity": "common",
        "price": 4,
        "attribute": "physical"
      },
      "thorn_crown": {
        "name": "Thorn Crown",
        "description": "A round wreath made of thorns bloodied by a saviour.",
        "stats": {
          "defense": 500
        },
        "rarity": "legendary",
        "price": 200000,
        "attribute": "holy"
      }
    },
    "chestpieces": {
      "leather_tunic": {
        "name": "Leather Tunic",
        "description": "A simple tunic made of supple leather, reinforced with metal studs. It offers basic protection against cuts and scrapes, ideal for light combat or travel. The tunic is comfortable and flexible, allowing for ease of movement and breathability.\n",
        "stats": {
          "defense": 5
        },
        "rarity": "common",
        "price": 5,
        "attribute": "physical"
      },
      "goblin_chestplate": {
        "name": "Goblin Chestplate",
        "description": "A crudely fashioned chestplate made from scavenged metal plates and reinforced with leather. It is lightweight but offers moderate protection against physical damage. Though it lacks the refinement of higher-grade armor, it is designed for agility rather than brute strength.\n",
        "stats": {
          "defense": 3,
          "agility": 4
        },
        "rarity": "common",
        "price": 6,
        "attribute": "physical"
      },
      "flameforged_breastplate": {
        "name": "Flameforged Breastplate",
        "description": "A chestpiece of molten metal, glowing with a faint, fiery aura. Etched with flame-like patterns, it offers protection against fire while radiating warmth and strength. The heat seems to linger in the metal, enhancing the wearer’s resilience.\n",
        "stats": {
          "defense": 24,
          "health": 12
        },
        "rarity": "rare",
        "price": 50,
        "attribute": "fire"
      },
      "moonlight_cloak": {
        "name": "Moonlight Cloak",
        "description": "A flowing cloak woven from silvery fibers that catch the light like dew on leaves. It feels cool to the touch and seems to blend seamlessly with the natural world, offering its wearer a quiet harmony with the elements and a subtle, elusive grace under the night sky.\n",
        "stats": {
          "defense": 5,
          "agility": 25
        },
        "rarity": "exquisite",
        "price": 105,
        "attribute": "natural"
      },
      "wraith_shroud": {
        "name": "Wraith Shroud",
        "description": "A dark, ethereal cloak woven from shadowy threads. It flickers as if alive, offering near-invisibility in the dark. Crafted by wraiths, it grants both concealment and an unsettling aura.\n",
        "stats": {
          "defense": 16,
          "agility": 20
        },
        "rarity": "exquisite",
        "price": 125,
        "attribute": "necrotic"
      }
    },
    "leggings": {
      "leather_pants": {
        "name": "Leather Pants",
        "description": "A pair of sturdy leather pants, reinforced with metal rivets and patches. The leather is thick and durable, offering protection against cuts and scrapes. The pants are comfortable and flexible, ideal for travel or light combat.",
        "stats": {
          "defense": 10
        },
        "rarity": "common",
        "price": 5,
        "attribute": "physical"
      }
    },
    "boots": {
      "black_leather_boots": {
        "name": "Black Leather Boots",
        "description": "A pair of sturdy black boots, made of thick leather and reinforced with metal buckles. The soles are rugged and durable, providing good traction on various terrains. The boots are comfortable and well-made, ideal for long journeys or combat.",
        "stats": {
          "defense": 5
        },
        "rarity": "common",
        "price": 2,
        "attribute": "physical"
      }
    },
    "charms": {
      "wood_charm": {
        "name": "Wooden Charm",
        "description": "A small wooden charm carved in the shape of a stag. It is smooth to the touch, with intricate details etched into the wood. The charm radiates a faint, comforting energy, as if connected to the natural world.",
        "stats": {
          "health": 5
        },
        "rarity": "common",
        "price": 3,
        "attribute": "natural"
      },
      "fox_grace_medallion": {
        "name": "Fox Grace Medallion",
        "description": "A delicate silver medallion engraved with the image of a leaping fox, surrounded by intricate patterns. The medallion glows faintly with an ethereal light, said to be imbued with the grace and agility of a fox. It is a token of swiftness, granting the wearer enhanced dexterity and reflexes.\n",
        "stats": {
          "agility": 10
        },
        "rarity": "common",
        "price": 12,
        "attribute": "natural"
      },
      "small_quiver": {
        "name": "Small Quiver",
        "description": "A compact quiver designed to hold a small number of arrows or bolts. While not as sturdy or large as standard quivers, it is lightweight and easy to carry, making it perfect for quick engagements or long journeys.\n",
        "stats": {
          "agility": 7,
          "defense": 3
        },
        "rarity": "common",
        "price": 10,
        "attribute": "physical",
        "skill": "quiver"
      },
      "silver_chains": {
        "name": "Silver Chains",
        "description": "Cold, tarnished silver chains, their links faintly glowing with an ethereal light. They feel unnervingly heavy, as if carrying the weight of a lingering spirit, and strange markings pulse across their surface, fading in and out of sight.",
        "rarity": "rare",
        "price": 50,
        "attribute": "necrotic",
        "skills": "weakness"
      },
      "silver_cross": {
        "name": "Silver Cross",
        "description": "A delicate, polished cross made of fine silver, its surface gleaming with a soft, reflective sheen. Intricate engravings trace the edges, depicting symbols of protection and faith.\n",
        "stats": {
          "health": 10
        },
        "rarity": "common",
        "price": 10,
        "attribute": "holy"
      },
      "war_medal": {
        "name": "War Medal",
        "description": "A metal medal worn by a barbarian leader or hero, usually awarded for bravery in battle or for victories in clan wars. It is often engraved with symbols of strength or victory and is worn with pride.\n",
        "stats": {
          "attackDmg": 10,
          "critChance": 0.1
        },
        "rarity": "rare",
        "price": 42
      }
    },
    "rings": {
      "copper_ring": {
        "name": "Copper Ring",
        "description": "A small ring made of copper",
        "stats": {
          "health": 2
        },
        "rarity": "common",
        "price": 2
      },
      "silver_ring": {
        "name": "Silver Ring",
        "description": "A small ring made of silver",
        "stats": {
          "defense": 3
        },
        "rarity": "common",
        "price": 3
      },
      "forgotten_ring": {
        "name": "Forgotten Ring",
        "description": "A small, deep blue ring, its surface smooth and cold to the touch. White stones encircle its circumference, their faint glow barely visible, as though they've dimmed over time. This ring feels ancient, its presence heavy with the weight of forgotten history. Its origin is unknown, but whispers speak of a Forgotten Realm, a place lost to time and memory, where powerful artifacts like this were forged.",
        "stats": {
          "defense": 10,
          "attackDmg": 10
        },
        "rarity": "exquisite",
        "price": 200,
        "attributes": "necrotic",
        "skills": "pierce"
      },
      "goblin_chieftain_ring": {
        "name": "Goblin Chieftain's Ring",
        "description": "A worn ring crafted from crude metal, adorned with a twisted symbol of goblin tribes. The ring is imbued with dark magic and represents the authority of a goblin chieftain, often passed down through generations.\n",
        "stats": {
          "defense": 25,
          "agility": 10,
          "critChance": 0.1
        },
        "rarity": "exquisite",
        "price": 175,
        "attributes": "physical"
      }
    },
    "materials": {
      "knowledge_of_the_forest": {
        "name": "Knowledge of the Forest",
        "description": "A gift bestowed by the forest's ancient guardian, its wisdom unfolds not in words but in visions and whispers. You now perceive the world differently—the rustle of leaves and the song of water reveal hidden paths and long-lost truths.\nThe elder oak near the waterfall holds the first key, but the deeper you delve, the more perilous the journey becomes. This newfound knowledge is both a blessing and a burden, promising to guide the worthy toward a destiny entwined with the heart of the forest and the blade of legend.\n",
        "rarity": "legendary",
        "price": 10000000
      },
      "bundle_of_sage": {
        "name": "Bundle of Sage",
        "description": "A collection of dried sage leaves tied with twine. Used for rituals and purification, its calming aroma is believed to ward off evil spirits and cleanse negative energy.\n",
        "rarity": "common",
        "price": 3
      },
      "emerald": {
        "name": "Emerald",
        "description": "A vibrant green gemstone as lush as a forest in spring. Representing vitality and prosperity, it is cherished for its ability to bring balance and renewal.\n",
        "rarity": "rare",
        "price": 100
      },
      "ruby": {
        "name": "Ruby",
        "description": "A fiery red gemstone that seems to pulse with inner warmth. Revered as a symbol of passion and power, it is a favorite among those seeking strength and courage.\n",
        "rarity": "rare",
        "price": 100
      },
      "sapphire": {
        "name": "Sapphire",
        "description": "A deep blue gemstone that sparkles like the night sky. Often associated with wisdom and clarity, it is highly valued for its beauty and mystical properties.\n",
        "rarity": "rare",
        "price": 100
      },
      "soul_essence": {
        "name": "Soul Essence",
        "description": "A shimmering, ethereal substance that glows with an inner light. It is said to contain the essence of a soul, a fragment of life's energy. Soul Essence is a rare and powerful material, sought after for its mystical properties.\n",
        "rarity": "rare",
        "price": 50
      },
      "abyssal_essence": {
        "name": "Abyssal Essence",
        "description": " A dark, viscous fluid pulsing with otherworldly energy. It seems to absorb light, emanating a faint, eerie glow from within. This essence is harvested from the deepest voids of the Abyss.\n",
        "rarity": "legendary",
        "price": 6100
      },
      "shadow_fibre": {
        "name": "Shadow Fibre",
        "description": "A thin, flexible thread spun from pure shadow. Its surface shimmers with a faint, otherworldly glow, making it perfect for crafting items that require stealth or shadow manipulation.\n",
        "rarity": "exquisite",
        "price": 100
      },
      "soulstone": {
        "name": "Soulstone",
        "description": "A small, smooth stone that pulses with an eerie light, as if it holds the essence of a soul within. The stone is cold to the touch, but it hums with a faint energy that resonates deep within the mind, stirring both fear and curiosity.\n",
        "rarity": "exquisite",
        "price": 115
      },
      "tome_of_abyss": {
        "name": "Tome of the Abyss",
        "description": "A forbidden tome bound in dark, otherworldly leather, its pages filled with arcane symbols and knowledge from the Abyss. The cover bears a unique, intricate symbol, glowing faintly in the dim light. The tome contains powerful insights into shadow magic and the dark arts, offering the reader access to dangerous but potent abilities. Though forbidden in many realms, those bold enough to study its contents may unlock powers that challenge the very fabric of reality.\n",
        "rarity": "exquisite",
        "price": 245
      },
      "silver_antler_shard": {
        "name": "Silver Antler Shard",
        "description": "A fragment of the Silver Stag’s majestic antlers, imbued with celestial energy. The shard gleams faintly in the light, said to bring protection and fortune to those who carry it.\n",
        "rarity": "legendary",
        "price": 5000
      },
      "wolf_fang": {
        "name": "Wolf Fang",
        "description": "A sharp, elongated fang from a wolf, its surface slightly worn from use. The tooth is strong and jagged, a symbol of the wolf's ferocity and survival instincts.\n",
        "rarity": "common",
        "price": 4
      },
      "wolf_pelt": {
        "name": "Wolf Pelt",
        "description": "A thick, coarse pelt from a wolf, its fur is soft to the touch but tough and durable. The scent of the wild is still faintly present. A prized possession among hunters and craftsmen alike.\n",
        "rarity": "common",
        "price": 6
      },
      "goblin_tooth": {
        "name": "Goblin Tooth",
        "description": "A jagged, yellowed tooth from a goblin, sharp and crooked. The tooth is small but durable, a testament to the goblin's hardy nature and aggressive tendencies. A common item among scavengers and those who deal with goblinkind.\n",
        "rarity": "common",
        "price": 5
      },
      "goblin_arrowhead": {
        "name": "Goblin Arrowhead",
        "description": "A crude arrowhead made from sharpened stone or bone, often attached to a thin wooden shaft. It is lightweight but dangerous in the hands of a goblin archer, designed for quick, lethal strikes.\n",
        "rarity": "common",
        "price": 5
      },
      "goblin_peace_offering": {
        "name": "Goblin Peace Offering",
        "description": "A small bundle of items presented as a gesture of goodwill or appeasement, typically including a mix of trinkets, food, or simple crafts. While seemingly insignificant, this offering can be used to pacify an enemy or broker a temporary truce. It’s often used by goblins when they seek to avoid conflict or gain favor from a more powerful entity. Its value lies in the diplomacy it can bring rather than any inherent worth.\n",
        "rarity": "exquisite",
        "price": 200
      },
      "goblin_bloodstone": {
        "name": "Goblin Bloodstone",
        "description": "A small, blood-red gem with a faint glow that seems to pulse with the life force of its previous owner. The bloodstone is believed to be infused with the essence of a goblin, possibly from a sacrifice or ritualistic act.\n",
        "rarity": "exquisite",
        "price": 95
      },
      "smooth_pebbles": {
        "name": "Smooth Pebbles",
        "description": "Small, rounded stones with a polished texture, often used for skipping across water or as a calming tactile object.\n",
        "rarity": "common",
        "price": 4
      },
      "string": {
        "name": "String",
        "description": "A simple yet durable length of thread, versatile for crafting, binding, or repairs. Perfect for any adventurer's toolkit.\n",
        "rarity": "common",
        "price": 1
      },
      "iron_scrap": {
        "name": "Iron Scrap",
        "description": " small, jagged piece of iron scavenged from discarded weapons, armor, or tools. While it may seem insignificant, the iron scrap is still useful in crafting or reforging. It’s often found among wreckage or remnants of battles.\n",
        "rarity": "common",
        "price": 3
      },
      "shackled_choir_key": {
        "name": "Shackled Choir key",
        "description": "This rusted iron key, twisted and jagged, is a relic of the cursed Shackled Choir, a cult bound by chains and driven by maddening hymns. The key is engraved with shackles and broken chains, symbols of their eternal torment. It's said to hold the power to unlock long-forgotten secrets, with the faint echoes of their haunting voices still lingering in the air.\n",
        "rarity": "rare",
        "price": 200
      },
      "drakthul_heart": {
        "name": "Heart of Drakthul",
        "description": "A dark, pulsating organ that still beats with unnatural vitality, despite being severed from its host. The heart is wrapped in silver chains, and its surface shimmers with a faint, shadowy glow, radiating an aura of malice.\n",
        "rarity": "legendary",
        "price": 500000
      },
      "obsidian": {
        "name": "Obsidian",
        "description": "A dark, glass-like volcanic rock known for its sharp edges and smooth surface. It’s often used for crafting tools or weapons due to its natural ability to fracture into razor-sharp shards.\n",
        "rarity": "rare",
        "price": 30
      },
      "bone": {
        "name": "Bone",
        "description": "A bone from a deceased corpse used to make up a skeleton.\n",
        "rarity": "common",
        "price": 1
      }
    }
  }
}