{"items": {
    "weapons": {
      "common_sword": {
        "name": "Sword",
        "description": "A simple, well-used sword with a steel blade and a leather-wrapped hilt. It shows signs of wear but remains sharp and balanced, reliable for basic combat. A practical weapon for any adventurer.",
        "stats": {
          "attackDmg": 10
        },
        "rarity": "common",
        "price": 2,
        "attribute": "physical"
      },
      "common_lance": {
        "name": "Lance",
        "description": "A sturdy, well-balanced lance with a long wooden shaft and a steel tip. The wood is worn from use, but it remains strong and reliable. The blade is simple, practical, and effective for mounted combat or thrusting. A dependable weapon, ideal for soldiers or adventurers seeking a reliable polearm.",
        "stats": {
          "attackDmg": 10
        },
        "rarity": "common",
        "price": 2
      },
      "common_mace": {
        "name": "Mace",
        "description": "A heavy, blunt mace with a steel head and a wooden handle. The mace is well-crafted and sturdy, designed for crushing blows and armored opponents. The weight of the mace gives it considerable impact, making it a formidable weapon in close combat. A reliable choice for warriors or knights facing heavily armored foes.",
        "stats": {
          "attackDmg": 20
        },
        "rarity": "common",
        "price": 2
      },
      "verdant": {
        "name": "Bow of Verdant",
        "description": "A beautifully crafted longbow, entwined with glowing vines. Forged in an ancient forest, it channels the power of nature, enhancing accuracy and imbuing arrows with the forest's energy. Ideal for those attuned to nature, it strikes with precision to strike down enemies with the force of the wild.",
        "stats": {
          "attackDmg": 150
        },
        "rarity": "exquisite",
        "price": 80,
        "attribute": "natural"
      },
      "excalibur": {
        "name": "Excalibur",
        "description": "The legendary sword of unmatched power. Its blade gleams with a radiant, otherworldly light, etched with ancient runes. The hilt is adorned with gold and precious gems, radiating an aura of divine authority. This is no ordinary weapon—its strike is destined to change the course of history.",
        "stats": {
          "attackDmg": 750
        },
        "rarity": "legendary",
        "price": 1000000000,
        "attribute": "holy"
      }
    },
    "helmets": {
      "thorn_crown": {
        "name": "Thorn Crown",
        "description": "A round wreath made of thorns bloodied by a saviour.",
        "stats": {
          "defense": 5
        },
        "rarity": "legendary",
        "price": 200000,
        "attribute": "holy"
      }
    },
    "chestpieces": {
      "leather_tunic": {
        "name": "Leather Tunic",
        "description": "A simple tunic made of supple leather, reinforced with metal studs. It offers basic protection against cuts and scrapes, ideal for light combat or travel. The tunic is comfortable and flexible, allowing for ease of movement and breathability.",
        "stats": {
          "defense": 5
        },
        "rarity": "common",
        "price": 5
      }
    },
    "leggings": {
      "leather_pants": {
        "name": "Leather Pants",
        "description": "A pair of sturdy leather pants, reinforced with metal rivets and patches. The leather is thick and durable, offering protection against cuts and scrapes. The pants are comfortable and flexible, ideal for travel or light combat.",
        "stats": {
          "defense": 10
        },
        "rarity": "common",
        "price": 5
      }
    },
    "boots": {
      "black_leather_boots": {
        "name": "Black Leather Boots",
        "description": "A pair of sturdy black boots, made of thick leather and reinforced with metal buckles. The soles are rugged and durable, providing good traction on various terrains. The boots are comfortable and well-made, ideal for long journeys or combat.",
        "stats": {
          "defense": 5
        },
        "rarity": "common",
        "price": 2
      }
    },
    "charms": {
      "wood_charm": {
        "name": "Wooden Charm",
        "description": "A small wooden charm carved in the shape of a stag. It is smooth to the touch, with intricate details etched into the wood. The charm radiates a faint, comforting energy, as if connected to the natural world.",
        "rarity": "common",
        "price": 2
      },
      "silver_chains": {
        "name": "Silver Chains",
        "description": "",
        "rarity": "rare",
        "price": 50,
        "skills": "weakness"
      }
    },
    "rings": {
      "copper_ring": {
        "name": "Copper Ring",
        "description": "A small ring made of copper",
        "stats": {
          "health": 20,
          "defense": 1
        },
        "rarity": "common",
        "price": 1
      },
      "silver_ring": {
        "name": "Silver Ring",
        "description": "A small ring made of silver",
        "stats": {
          "defense": 3
        },
        "rarity": "common",
        "price": 2
      },
      "forgotten_ring": {
        "name": "Forgotten Ring",
        "description": "A small, deep blue ring, its surface smooth and cold to the touch. White stones encircle its circumference, their faint glow barely visible, as though they've dimmed over time. This ring feels ancient, its presence heavy with the weight of forgotten history. Its origin is unknown, but whispers speak of a Forgotten Realm, a place lost to time and memory, where powerful artifacts like this were forged.",
        "stats": {
          "defense": 10,
          "attackDmg": 10
        },
        "rarity": "exquisite",
        "price": 200,
        "attributes": "necrotic",
        "skills": "pierce"
      }
    },
    "materials": {
      "soul_essence": {
        "name": "Soul Essence",
        "description": "A shimmering, ethereal substance that glows with an inner light. It is said to contain the essence of a soul, a fragment of life's energy. Soul Essence is a rare and powerful material, sought after for its mystical properties.",
        "rarity": "rare",
        "price": 50
      },
      "smooth_pebbles": {
        "name": "Smooth Pebbles",
        "description": "Small, rounded stones with a polished texture, often used for skipping across water or as a calming tactile object.",
        "rarity": "common",
        "price": 10
      },
      "string": {
        "name": "String",
        "description": "A simple yet durable length of thread, versatile for crafting, binding, or repairs. Perfect for any adventurer's toolkit.",
        "rarity": "common",
        "price": 2
      },
      "shackled_choir_key": {
        "name": "Shackled Choir key",
        "description": "This rusted iron key, twisted and jagged, is a relic of the cursed Shackled Choir, a cult bound by chains and driven by maddening hymns. The key is engraved with shackles and broken chains, symbols of their eternal torment. It's said to hold the power to unlock long-forgotten secrets, with the faint echoes of their haunting voices still lingering in the air.",
        "rarity": "rare",
        "price": 200
      }
    }
  }
}